Documents/ЗаявкаНаПеремещениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаявкаНаПеремещениеДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваКВыплате</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПолучатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусУтвержденияПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыУтвержденияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелательнаяДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйУтвердил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредстваКВыплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваКВыплате</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыУтвержденияПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыУтвержденияПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУтвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаПеремещениеДенежныхСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() тогда		
					
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	СостояниеОплачено = Объект.Проведен И РегистрыНакопления.ДенежныеСредстваКВыплате.ОпределитьСостояниеОплаты(Объект.Ссылка);
	ПравоУтверждения = РольДоступна("УтверждениеЗаявокНаПеремещениеДенежныхСредств")
					   ИЛИ РольДоступна("ПолныеПрава")
					   ИЛИ РольДоступна("АдминистраторСистемы");
	УстановитьСписокСтатусов();
	УстановитьДоступностьЭлементовПоСтатусу();
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если Объект.Валюта = Объект.ВалютаПолучатель Тогда
			Если НЕ Объект.Сумма = Объект.СуммаПолучатель Тогда
				ПоказатьПредупреждение(,"Сумма отправленная и сумма полученная не равны");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КассаОтправительПриИзменении(Элемент)
	КассаОтправительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КассаОтправительПриИзмененииНаСервере()
	Если НЕ Объект.КассаОтправитель.Валюта.Пустая() Тогда
		Объект.Валюта = Объект.КассаОтправитель.Валюта;
	Иначе
		Объект.Валюта = Константы.ВалютаУчета.Получить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КассаПолучательПриИзменении(Элемент)
	КассаПолучательПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КассаПолучательПриИзмененииНаСервере()
	Объект.ВалютаПолучатель = Объект.КассаПолучатель.Валюта;
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	Объект.ОрганизацияПолучатель = Объект.Организация;
	Объект.КассаПолучатель = Справочники.Кассы.ПустаяСсылка();
	Объект.ВалютаПолучатель = Справочники.Валюты.ПустаяСсылка();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтатусУтвержденияПлатежаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовПоСтатусу();
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	Если Объект.ВалютаПолучатель = Объект.Валюта Тогда 
		Объект.СуммаПолучатель = Объект.Сумма;
		
	ИначеЕсли Объект.СуммаПолучатель = 0 И НЕ ЗначениеЗаполнено(Объект.ВалютаПолучатель) Тогда
		Объект.СуммаПолучатель = Объект.Сумма;	
		Объект.ВалютаПолучатель = Объект.Валюта;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПолучательПриИзменении(Элемент)
	
	Если Объект.ВалютаПолучатель = Объект.Валюта Тогда 
		Объект.Сумма = Объект.СуммаПолучатель;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Если Объект.Валюта = Объект.ВалютаПолучатель Тогда 
		Объект.Сумма = Объект.СуммаПолучатель;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПолучательПриИзменении(Элемент)
	
	Если Объект.ВалютаПолучатель = Объект.Валюта Тогда 
		Объект.СуммаПолучатель = Объект.Сумма;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеЭлементамиФормы

&НаСервере
Процедура УстановитьСписокСтатусов()
	
	СписокВыбора = Элементы.СтатусУтвержденияПлатежа.СписокВыбора;
	Если Не ПравоУтверждения Тогда		
		СписокВыбора.Очистить();
		СписокВыбора.Добавить(Перечисления.СтатусыУтвержденияПлатежей.НеУтвержден);
		
		Если Объект.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден Тогда
			СписокВыбора.Добавить(Перечисления.СтатусыУтвержденияПлатежей.Утвержден);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовПоСтатусу()
	ТолькоПросмотрЭлементов = Ложь;
	
	Если Объект.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден Тогда	
		ТолькоПросмотрЭлементов = Истина;
	КонецЕсли;
		
	ЭлементыТолькоПросмотр = Новый Массив;
	ЭлементыТолькоПросмотр.Добавить(Элементы.НомерДата);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Кассы);
	ЭлементыТолькоПросмотр.Добавить(Элементы.Дополнительно);
	ЭлементыТолькоПросмотр.Добавить(Элементы.ГруппаСтатус);
	
	Для каждого Элемент Из ЭлементыТолькоПросмотр Цикл
		Элемент.ТолькоПросмотр = ТолькоПросмотрЭлементов;
	КонецЦикла;
	
	//ЭлементыДоступность = Новый Массив;
	//
	//Для каждого Элемент Из ЭлементыДоступность Цикл
	//	Элемент.Доступность = Не ТолькоПросмотрЭлементов;
	//КонецЦикла;
		
	Если ПравоУтверждения 
		И Объект.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден
		И НЕ СостояниеОплачено Тогда
		Элементы.ГруппаСтатус.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
